<a href="https://colab.research.google.com/github/Cello1x/Fecap/blob/main/Pre_processamento_de_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
dic = {'Nome' :['Isa', 'Peter', 'Rico'], 
       'Idade' :['19', '28', '0'], 
       'Salario': ['19000', '5000', '100'], 
       'Genero': ['F', 'M', 'M'], 
       'Cargo': ['Gerente', 'Supervisor', '']
       }

In [ ]:
df = pd.DataFrame(dic)
df

    Nome Idade Salario Genero       Cargo
0    Isa    19   19000      F     Gerente
1  Peter    28    5000      M  Supervisor
2   Rico     0     100      M

In [ ]:
df.info

<bound method DataFrame.info of     Nome Idade Salario Genero       Cargo
0    Isa    19   19000      F     Gerente
1  Peter    28    5000      M  Supervisor
2   Rico     0     100      M            >

In [ ]:
df = pd.get_dummies(df, columns=['Genero'])

In [ ]:
df

    Nome Idade Salario       Cargo  Genero_F  Genero_M
0    Isa    19   19000     Gerente         1         0
1  Peter    28    5000  Supervisor         0         1
2   Rico     0     100                     0         1

In [ ]:
df = df.drop(columns=['Cargo'])
df

    Nome Idade Salario  Genero_F  Genero_M
0    Isa    19   19000         1         0
1  Peter    28    5000         0         1
2   Rico     0     100         0         1